Repository: pumpkin-py/pumpkin-fun
Catalog: src/po/*.po
Languages: cs, sk

source: You asked a question, but did not add enough options.
cs: Ptáš se na otázku, ale nemám dost možností k výběru.
sk: Opýtal si sa otázku, ale nemám na výber dostatok možností.

source: Yes
cs: Ano
sk: Áno

source: No
cs: Ne
sk: Nie

source: Command encountered an error (E{code}).
cs: Při vykonávání příkazu došlo k chybě (E{code}).
sk: Príkaz narazil na chybu (E{code}).

source: Cat fact
cs: Fakt o kočkách
sk: Fakt o mačkách

source: Dog fact
cs: Fakt o psech
sk: Fakt o psoch

source: Description
cs: Popis
sk: Popis

source: I didn't find a joke like that.
cs: Takový vtip nebyl nalezen.
sk: Takýto vtip sa nenašiel.

source: Characters
cs: Charaktery
sk: Znaky

source: Parodies
cs: Parodie
sk: Paródie

source: Tags
cs: Tagy
sk: Tagy

source: Artists
cs: Umělci
sk: Umelci

source: Groups
cs: Skupiny
sk: Skupiny

source: Languages
cs: Jazyky
sk: Jazyky

source: Categories
cs: Kategorie
sk: Kategórie

source: Number of pages
cs: Počet stran
sk: Počet strán

source: Supply me with a magic number and I will give you what you desire
cs: Dodej mi kouzelné číslo a já ti dám, co si přeješ.
sk: Dodaj mi kúzelné číslo a ja ti dám, čo si praješ.

source: Regex for allowed URLs is `{regex}`.
cs: Regex pro povolené URL je `{regex}`.
sk: Regex pre povolené URL je `{regex}`.

source: Regex for allowed URLs is not set.
cs: Regex pro povolené URL není nastaven.
sk: Regex pre povolené URL nie je nastavený.

source: Regex for allowed urls successfuly unset.
cs: Regex pro povolené adresy úspěšně zrušen.
sk: Regex pre povolené adresy úspešne zrušený.

source: String `{regex}` is not valid regex.
cs: Řetězec `{regex}` není validní regex.
sk: Reťazec `{regex}` nie je validný regex.

source: String `{regex}` was successfuly set as allowed urls.
cs: Řetězec pro povolené URL adresy byl nastaven na `{regex}`.
sk: Reťazec pre povolené URL adresy bol nastavený na `{regex}`.

source: {channel} is already hash channel.
cs: {channel} je již nastaven jako hash kanál.
sk: Kanál {channel} je už nastavený ako hash kanál.

source: Channel {channel} added as hash channel with reaction limit **{reaction_limit}**.
cs: {channel} byl přidán jako hash kanál s limitem **{reaction_limit}** reakcí.
sk: Kanál {channel} bol pridaný ako hash kanál s limitom **{reaction_limit}** reakcií.

source: {channel} is not hash channel.
cs: {channel} není hash kanál
sk: Kanál {channel} nie je hash kanál.

source: Reaction limit must be higher than 0.
cs: Limit reakcí musí být vyšší než 0.
sk: Limit reakcií musí byť vyšší než 0.

source: Changed reaction limit for {channel} to **{reaction_limit}**.
cs: Limit reakcí byl v {channel} změněn na **{reaction_limit}**.
sk: V kanáli {channel} bol zmenený limit reakcií na **{reaction_limit}**.

source: This server has no hash channels.
cs: Tento server nemá žádné hash kanály.
sk: Tento server nemá žiadne hash kanály.

source: Hash channel {channel} removed.
cs: Hash kanál {channel} odstraněn.
sk: Hash kanál {channel} bol odstránený.

source: **LOADING**
cs: **NAČÍTÁNÍ**
sk: **NAČÍTAVANIE**

source: Downloaded **{count}** messages.
cs: Staženo **{count}** zpráv
sk: Stiahnutých bolo **{count}** správ.

source: **SCANNING**
cs: **SKENOVÁNÍ**
sk: **SKENOVÁNÍ**

source: Processed **{count}** out of **{total}** messages ({percent} %).
cs: Zpracování **{count}** z **{total}** zpráv ({percent} %).
sk: Spracovanie **{count}** z **{total}** správ ({percent} %).

source: Calculated **{hashes}** hashes.
cs: Vypočítáno **{hashes}** hashů.
sk: Vypočítaných **{hashes}** hashov.

source: **COMPLETED**
cs: **HOTOVO**
sk: **HOTOVO**

source: Processed **{messages}** messages.
cs: Zpracováno **{messages}** zpráv.
sk: Spracovné **{messages}** správ.

source: Calculated **{hashes}** image hashes in **{seconds}** seconds.
cs: Vypočítáno **{hashes}** hashů za **{seconds}** vteřin.
sk: Vypočítaných **{hashes}** hashov za **{seconds}** sekúnd.

source: Message **`{message_id}`**
cs: Zpráva **`{message_id}`**
sk: Správa **`{message_id}`**

source: Messages has no associtated hashes.
cs: Ke zprávám nepatří žádné hashe
sk: K správam nepatria žiadne hashe.

source: **{recycle} This is repost!**
cs: **{recycle} Tohle je repost!**
sk: **{recycle} Toto je repost!**

source: **{recycle} This is probably repost!**
cs: **{recycle} Tohle je nejspíš repost!**
sk: **{recycle} Toto je pravdepodobne repost!**

source: {shrug} This could be repost.
cs: {shrug} Tohle by mohl být repost
sk: {shrug} Toto môže byť repost.

source: {name}, matching **{similarity}**!
cs: {name}, shoda **{similarity}**!
sk: {name}, zhoda **{similarity}**!

source: Original
cs: Originál
sk: Originál

source: Hint
cs: Nápověda
sk: Nápoveda

source: _If image is repost, give it {recycle} reaction. If it's not, click here on {cross} and when we reach {limit} reactions, this message will be deleted._
cs: _Pokud je obrázek repost, dej mu reakci {recycle}. Pokud není, klikni na {cross} a po {limit} reakcích se tato zpráva smaže._
sk: _Pokiaľ je obrázok repost, daj mu reakciu {recycle}. Ak nie je repost, klikni na {cross} a keď sa dosiahne limit {limit} reakcií, táto správa bude odstránená._

source: You can't do that, they are not in this channel.
cs: To dělat nemůžeš, nejsou v tomto kanálu.
sk: To robiť nemôžeš, nie sú v tomto kanáli.

source: **{user}** did not highfive you back on time in #{channel}.
cs: Uživatel **{user}** ti v kanálu #{channel} nestihl na highfive odpovědět.
sk: Užívateľ **{user}** ti v kanáli #{channel} nestihol na highfive odpovedať.

source: Relations {name}
cs: Vztahy {name}
sk: Vzťahy {name}

source: gave / got
cs: rozdáno / získáno
sk: rozdané / získané

source: This server has not enabled any variants.
cs: Tento server nemá zapnuty žádné varianty.
sk: Tento server nemá zapnuté žiadne varianty.

source: Relation
cs: Vztah
sk: Vzťah

source: Channel
cs: Kanál
sk: Kanál

source: Variant
cs: Varianta
sk: Varianta

source: That relation does not exist.
cs: Takový vztah neexistuje.
sk: Tento vzťah neexistuje.

source: Relation **{command}** does not have any variant.
cs: Vztah **{command}** nemá žádné varianty.
sk: Vzťah **{command}** nemá žiadnu variantu.

source: Relation **{command}** has following variants:
cs: Vztah **{command}** má následující varianty:
sk: Vzťah **{command}** má ansledujúce varianty:

source: That relation does not have this variant.
cs: Vztah nemá takovou variantu.
sk: Tento vzťah nemá variantu.

source: Variant for **{command}** in **#{channel}** set to **{variant}**.
cs: Varianta pro **{command}** v **#{channel}** nastavena na **{variant}**.
sk: Varianta pre **{command}** v **#{channel}** nastavená na **{variant}**.

source: Relations {name}: {action}
cs: Vztahy {name}: {action}
sk: Vzťahy {name}: {action}

source: Relation statistics: {gave} given, {got} received.
cs: Statistiky vztahu: {gave} rozdáno, {got} získáno.
sk: Štatistika vzťahu: {gave} rozdané, {got} získané.

source: Unknown user
cs: Neznámý uživatel
sk: Neznámy používateľ

source: Given
cs: Rozdáno
sk: Rozdané

source: Nothing given
cs: Nic nerozdáno
sk: Nič nebolo rozdané

source: No data available.
cs: Data nejsou k dispozici.
sk: Žiadne dáta.

source: Received
cs: Získáno
sk: Prijato

source: Nothing received
cs: Nic nezískáno
sk: Nič nebolo prijaté

source: This server does not have defined any macros.
cs: Tento server nemá žádná makra.
sk: Tento server nemá žiadne makrá.

source: Macro name
cs: Název makra
sk: Názov makra

source: Invocations
cs: Spuštění
sk: Spustenie

source: Triggers
cs: Spouštěče
sk: Spúšťače

source: Macro with that name does not exist.
cs: Makro s takovým názvem neexistuje.
sk: Makro s takým menom neexistuje.

source: Macro details: {name}
cs: Detaily o makru: {name}
sk: Detaily o makre: {name}

source: This macro was run {count} times in total.
cs: Toto makro bylo celkem spuštěno {count}-krát.
sk: Toto makro bolo celkom spustené {count}-krát.

source: Responses
cs: Odpovědi
sk: Odpovede

source: Case sensitive
cs: Rozlišení velikosti písmen
sk: Rozlíšenie veľkosti písmen

source: Forward to DM
cs: Přeposlat do DM
sk: Preposlať do DM

source: Delete the trigger
cs: Smazat spouštěč
sk: Zmazať spúšťač

source: Channels
cs: Kanály
sk: Kanály

source: Users
cs: Uživatelé
sk: Užívatelia

source: Macro could not be added:
cs: Makro nemohlo být přidáno:
sk: Makro nemohlo byť pridané:

source: Macro with that name already exists.
cs: Makro s takovým jménem již existuje.
sk: Makro s takým menom už existuje.

source: Argument --{arg} must be specified.
cs: Musí být uveden argument --{arg}.
sk: Musí byť uvedený argument --{arg}.

source: Macro **{name}** created.
cs: Makro **{name}** vytvořeno.
sk: Makro **{name}** vytvorené.

source: No arguments specified.
cs: Nebyly uvedeny žádné argument.y
sk: Neboli uvedené žiadne argumenty.

source: Macro **{name}** updated.
cs: Makro **{name}** aktualizováno.
sk: Makro **{name}** aktualizované.

source: Macro **{name}** removed.
cs: Makro **{name}** odebráno.
sk: Makro **{name}** vymazané.

source: Nickname change prices
cs: Ceny změn přezdívek

source: Values are in karma points.
cs: Hodnoty jsou v karma bodech

source: Set
cs: Změna

source: Reset
cs: Resetování

source: Cannot change nickname because module karma is not loaded.
cs: Nelze změnit přezdívku, protože karma karma není načten.

source: That nickname is same as current nickname.
cs: To je tvoje aktuální přezdívka.

source: That nickname is forbidden keyword.
cs: To je zakázané klíčové slovo.

source: That nickname includes some forbidden characters.
cs: Taková přezdívka obsahuje zakázané znaky.

source: The length of a nickname must be between 2 and 32 characters.
cs: Délka přezdívky musí být mezi dvěma a 32 znaky.

source: Unable to change nickname, **set** price not configured.
cs: Přezdívku nelze změnit, **set** cena nebyla nastavena.

source: No enough karma, try to chat more to earn karma.
cs: Nedostatek karmy, pro zisk karmy se více zapoj do konverzace.

source: Cannot change nickname because you have greater privileges.
cs: Není možné změnit přezdívku z důvodu vyššího oprávnění.

source: Congratulations, you have been renamed to **{nickname}**.
cs: Gratuluji, přezdívka ti byla změněna na **{nickname}**.

source: Cannot change nickname because mudule karma is not loaded.
cs: Není možné změnit jméno, protože modul karma není načten.

source: Unable to change nickname, **unset** price not configured.
cs: Přezdívku nelze změnit, **unset** cena nebyla nastavena.

source: You have no nickname here.
cs: Žádnou přezdívku tu nemáš.

source: Congratulations, your nickname has been removed.
cs: Gratuluji, tvoje přezdívka byla odstraněna.

source: Set nor reset price cannot be negative.
cs: Cena za nastavení ani zrušení nemůže být negativní.

source: Prices have been successfully updated.
cs: Ceny byly uspěšně aktualizovány.

source: Prices have not been successfully updated.
cs: Ceny nebyly úspěšně aktualizovány.

source: No items found.
cs: Nebyly nalezeny žádné položky.
sk: Nenašli sa žiadne položky.

source: Seeking
cs: Hledám
sk: Hľadám

source: Unknown User
cs: Neznámý uživatel
sk: Neznámy užívateľ

source: The text is too long, the limit is 140 characters.
cs: Text je příliš dlouhý, limit je 140 znaků.
sk: Text je príliš dlhý, limit je 140 znakov.

source: The item was added as #{idx}.
cs: Tato položka byla přidána jako #{idx}.
sk: Položka bola pridaná ako #{idx}.

source: Item #{idx} does not exist.
cs: Položka #{idx} neexistuje.
sk: Položka #{idx} neexistuje.

source: You don't have permission to remove #{idx}.
cs: Nemáš oprávnění odstranit #{idx}.
sk: Nemáš oprávnenie na odstránenie #{idx}.

source: The item was deleted.
cs: Položka byla vymazána.
sk: Položka bola odstránená.

source: All items were deleted.
cs: Všechny položky byly vymazány.
sk: Všetky položky boli odstránené.

source: Night
cs: Noc
sk: Noc

source: Morning
cs: Ráno
sk: Ráno

source: Afternoon
cs: Odpoledne

source: Evening
cs: Večer
sk: Večer

source: Today
cs: Dnes

source: Tomorrow
cs: Zítra

source: {date}: {lower} to {upper} {deg}
cs: {date}: {lower} až {upper} {deg}

source: Weather forecast for **{place}, {country}**
cs: Předpověď počasí pro **{place}, {country}**

source: Temperature: **{lower} to {upper} {deg}**
cs: Teplota: **{lower} až {upper} {deg}**

source: Temperature: **{upper} {deg}**
cs: Teplota: **{upper} {deg}**

source: Clouds: **{valmax} %**
cs: Oblačnost: **{valmax} %**

source: Relative humidity: **{valmax} %**
cs: Relativní vlhkost: **{valmax} %**

source: Fogginess: **{valmax}**
cs: Mlha: **{valmax} %**

source: *Air pressure: {valmin} to {valmax} hPa*
cs: *Tlak: {valmin} až {valmax} hPa*

source: *Wind speed: up to {valmax} m/s*
cs: *Rychlost větru: až {valmax} m/s*

source: *UV index: up to {valmax}*
cs: *UV index: až {valmax}*

source: *Extra information*
cs: *Doplňující informace*

source: That's not valid place name.
cs: To není platný název místa.
sk: Tento názov miesta nieje platný.

source: Your preferred weather place set to **{place}**.
cs: Preferované místo předpovědi počasí nastaveno na **{place}**.
sk: Tvoje preferované miesto na počasie bolo nastavené na **{place}**.

source: You don't have any place preference saved.
cs: Nemáš nastavené preferované místo.
sk: Nemáš nastavené žiadne preferované miesto počasia.

source: Your preferred weather place was removed.
cs: Preference místa předpovědi počasí byla odstraněna.
sk: Tvoje preferované miesto počasia bolo zmazané.

source: Server's preferred weather place set to **{place}**.
cs: Preference místa předpovědi počasí pro server byla nastavena na **{place}**.
sk: Preferencia miesta predpovedi počasia pre server bola nastavená na **{place}**.

source: This server doesn't have any place preference saved.
cs: Tento server nemá nastavené preferované místo.
sk: Tento server nemá nastavené žiadne preferované miesto počasia.

source: Server's preferred weather place was removed.
cs: Preference místa předpovědi počasí pro server byla odstraněna.
sk: Preferencia miesta predpovede počasia pre server bola odstránená.

source: Weather forecast preference
cs: Preference předpovědi počasí
sk: Preferencia predpovede počasia

source: Your preference
cs: Tvoje preference
sk: Tvoja preferencia

source: *No preference set*
cs: *Nenastavena*
sk: *Preferencia nenastavená*

source: Server preference
cs: Preference serveru
sk: Preferencie servera

source: You have to specify a place or set a preference.
cs: Musíš uvést místo nebo si nastavit preferenci.
sk: Musíš zadať miesto alebo si nastaviť preferenciu.

source: Submitted place could not be found.
cs: Zadané místo nebylo nalezeno.

source: Forecast server refused the geolocation.
cs: Server odmítl geografickou lokaci.

source: Ask me what you want to know and I will answer.
cs: Zeptej se mě na to, co chceš vědět a já ti odpovím.
sk: Opýtaj sa ma čo chceš vedieť a ja ti odpoviem.

source: Match
sk: Zhoda
